Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Downloads for v2.0-a076 and later include an offline help file in the same zip as the main program.
ja: v2.0-a076以降のダウンロードには、メイン・プログラムと同じzipファイルにオフライン・ヘルプ・ファイルが含まれています。

source: Downloads text to a variable.
ja: テキストを変数にダウンロードします。

source: Drag the crosshair from Winspector Spy's window to "New Message" window's titlebar (the portion not covered by Winspector Spy's overlay).
ja: Winspector Spyのウィンドウから十字線を「New Message」ウィンドウのタイトルバー（Winspector Spyのオーバーレイで覆われていない部分）にドラッグする。

source: Dragging can also be done via the various Send functions, which is more flexible because the mode can be specified via the function name.
ja: ドラッグは各種送信機能でも行えますが、機能名でモードを指定できるため、より柔軟な対応が可能です。

source: Draws a half-sunken border around a static control.
ja: 静的コントロールの周囲に半分沈んだボーダーを描く。

source: Draws the frame of the static control using the EDGE_ETCHED edge style.
ja: EDGE_ETCHED エッジスタイルを使用して静的コントロールのフレームを描画します。

source: Draws the left and right edges of the static control using the EDGE_ETCHED edge style.
ja: EDGE_ETCHEDエッジスタイルを使用して、静的コントロールの左右のエッジを描画します。

source: Draws the top and bottom edges of the static control using the EDGE_ETCHED edge style.
ja: EDGE_ETCHEDエッジスタイルを使用して、静的コントロールの上端と下端を描画します。

source: Drive Functions
ja: Drive関数

source: Drive functions
ja: Drive関数

source: DriveEject / DriveRetract - Syntax & Usage | AutoHotkey v2
ja: DriveEject / DriveRetract - 構文と使用法｜AutoHotkey v2

source: DriveEject and DriveRetract correspond to the IOCTL_STORAGE_EJECT_MEDIA and IOCTL_STORAGE_LOAD_MEDIA control codes, which may also have an effect on drive types other than CD/DVD, such as tape drives.
ja: DriveEject、DriveRetractは、IOCTL_STORAGE_EJECT_MEDIA、IOCTL_STORAGE_LOAD_MEDIA制御コードに対応しており、テープドライブなどCD/DVD以外のドライブタイプにも影響を与える場合があります。

source: DriveEject is therefore able to eject non-CD/DVD drives which have an "Eject" option in Explorer (i.e. removable drives but not external hard drives which show as fixed disks).
ja: DriveEjectは、エクスプローラーに「取り出し」オプションがあるCD/DVD以外のドライブ（リムーバブルドライブ、固定ディスクとして表示される外付けハードディスクは除く）を取り出すことができます。

source: DriveGetCapacity - Syntax & Usage | AutoHotkey v2
ja: DriveGetCapacity - 構文と使用法｜AutoHotkey v2

source: DriveGetFileSystem - Syntax & Usage | AutoHotkey v2
ja: DriveGetFileSystem - 構文と使用法｜AutoHotkey v2

source: DriveGetLabel - Syntax & Usage | AutoHotkey v2
ja: DriveGetLabel - 構文と使用法｜AutoHotkey v2

source: DriveGetList - Syntax & Usage | AutoHotkey v2
ja: DriveGetList - 構文と使用法｜AutoHotkey v2

source: DriveGetSerial - Syntax & Usage | AutoHotkey v2
ja: DriveGetSerial - 構文と使用法｜AutoHotkey v2

source: DriveGetSpaceFree - Syntax & Usage | AutoHotkey v2
ja: DriveGetSpaceFree - 構文と使用法｜AutoHotkey v2

source: DriveGetStatus - Syntax & Usage | AutoHotkey v2
ja: DriveGetStatus - 構文と使用法｜AutoHotkey v2

source: DriveGetStatusCD - Syntax & Usage | AutoHotkey v2
ja: DriveGetStatusCD - 構文と使用法｜AutoHotkey v2

source: DriveGetType - Syntax & Usage | AutoHotkey v2
ja: DriveGetType - 構文と使用法｜AutoHotkey v2

source: DriveLock - Syntax & Usage | AutoHotkey v2
ja: DriveLock - 構文と使用法｜AutoHotkey v2

source: DriveSetLabel - Syntax & Usage | AutoHotkey v2
ja: DriveSetLabel - 構文と使用法｜AutoHotkey v2

source: DriveUnlock - Syntax & Usage | AutoHotkey v2
ja: DriveUnlock - 構文と使用法｜AutoHotkey v2

source: DropDownList (or DDL)
ja: DropDownList（またはDDL）

source: DropDownList and ComboBox Control Styles
ja: DropDownListとComboBoxコントロールのスタイル

source: Due to Critical, any new thread that is launched during this time (e.g. by pressing the hotkey again) will be postponed until the tooltip disappears.
ja: Criticalのため、この間に起動した新しいスレッド（例：ホットキーをもう一度押す）は、ツールチップが消えるまで延期されます。

source: Due to OS limitations, Checkboxes, Radio buttons, and GroupBoxes for which a non-default text color was specified will take on the Classic Theme appearance.
ja: OSの制限により、デフォルト以外の文字色が指定されたチェックボックス、ラジオボタン、グループボックスは、クラシックテーマの外観となります。

source: Due to a quirk in Windows, .wav files with a path longer than 127 characters will not be played.
ja: Windowsの癖により、パスが127文字以上の.wavファイルは再生されません。

source: Due to its ability to buffer events, the function Critical is generally superior to this sub-function.
ja: イベントをバッファリングする能力があるため、一般的には、このサブファンクションよりもクリティカルファンクションの方が優れている。

source: Due to its greater flexibility and its ability to buffer events, the function Critical is generally more useful than Thread "Interrupt" and Thread "Priority".
ja: 柔軟性が高く、イベントをバッファリングできるため、Critical関数はThread "Interrupt"やThread "Priority"よりも一般的に有用である。

source: Due to split-second timing, this property may be more reliable than GetKeyState even if it is used immediately after Input terminates, or in the OnEnd callback.
ja: 一瞬のタイミングのため、このプロパティは、Inputが終了した直後やOnEndコールバックで使用されても、GetKeyStateよりも信頼性が高い場合があります。

source: Due to system behavior, the following keys separated by a slash are identified differently depending on whether NumLock is ON or OFF.
ja: システムの動作上、スラッシュで区切られた以下のキーは、NumLockのON/OFFによって識別が異なります。

source: Due to the granularity of the OS's time-keeping system, Delay is typically rounded up to the nearest multiple of 10 or 15.6 milliseconds (depending on the type of hardware and drivers installed).
ja: OSの時間管理システムの粒度のため、Delayは通常、10ミリ秒または15.6ミリ秒の倍数に切り上げられる（インストールされているハードウェアとドライバーの種類によって異なる）。

source: Due to the granularity of the OS's time-keeping system, Period is typically rounded up to the nearest multiple of 10 or 15.6 milliseconds (depending on the type of hardware and drivers installed).
ja: OSの時間管理システムの粒度のため、Periodは通常10または15.6ミリ秒の最も近い倍数に切り上げられます（インストールされているハードウェアとドライバの種類に依存します）。

source: Due to the granularity of the OS's time-keeping system, delays might be rounded up to the nearest multiple of 10 or 15.
ja: OSの時間管理システムの粒度の関係で、遅延は10や15の倍数に切り上げられる場合があります。

source: Due to the granularity of the system timer (usually 15.6 milliseconds), the default interval for non-Critical threads (5 milliseconds) might appear to pass the instant after the function starts.
ja: システムタイマーの粒度（通常は15.6ミリ秒）により、非クリティカルスレッドのデフォルト間隔（5ミリ秒）は、関数が開始した瞬間に経過しているように見えるかもしれません。

source: Due to the risk of ambiguity (e.g. with a hotstring ending in */), any */ which is not preceded by /* is no longer ignored (reversing a change made in AHK_L revision 54).
ja: 曖昧さが生じる恐れがあるため（例えば、*/で終わるホットストリングでは）、*/の前に/*がないものは無視されるようになりました（AHK_L revision 54での変更点を取り消します）。

source: During loading, the script is optimized and validated.
ja: ロード中、スクリプトは最適化され、検証される。

source: During such times, timers will not run.
ja: この間、タイマーは作動しません。

source: During that time, such timers will not run, and any attempt by the user to create a thread (such as by pressing a hotkey or GUI button) will have no effect, nor will it be buffered.
ja: その間、そのようなタイマーは実行されず、ユーザーが（ホットキーや GUIボタンを押すなどして）スレッドを作成しようとしても、何の効果もなく、バッファリングもされない。

source: During the delay (sleep), the current thread is made uninterruptible.
ja: 遅延（スリープ）中は、現在のスレッドを中断できないようにする。

source: Dynamic Labels
ja: ダイナミック・ラベル

source: Dynamic Properties
ja: ダイナミック・プロパティ

source: Dynamic Variables
ja: ダイナミックな変数

source: Dynamic properties are copied, not invoked.
ja: ダイナミックプロパティはコピーされ、呼び出されることはありません。

source: Dynamic properties are included in the enumeration.
ja: ダイナミックプロパティは、列挙に含まれます。

source: Dynamic properties do not contain a value, but instead call an accessor function depending on how they are accessed (get, set or call).
ja: ダイナミックプロパティは値を持たず、アクセス方法（get、set、call）に応じてアクセッサ関数を呼び出します。

source: Dynamically Calling a Function
ja: 関数を動的に呼び出す

source: END OF TERMS AND CONDITIONS
ja: 利用規約の終わり

source: EOL translation is not performed by default; that is, linefeed (`n) characters are written as-is unless the "`n" option is present.
ja: つまり、"`n"オプションがない限り、改行文字(`n)はそのまま書き込まれます。

source: EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM "AS IS" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
ja: 書面で別段の記載がある場合を除き、『コピーライト』保有者および/またはその他の当事者は、明示または黙示を問わず、商品性および特定目的への適合性に関する黙示の保証を含むがこれに限定されない、いかなる種類の保証もなく、『プログラム』を「現状のまま」提供する。

source: EXE, DLL, CPL, SCR, and other types that contain icon resources.
ja: EXE、DLL、CPL、SCRなど、アイコンリソースを含むタイプ。

source: Each expression is tokenized and converted from infix to postfix.
ja: 各式はトークン化され、infixからpostfixに変換されます。

source: Each thread retains its own collection of the above settings, so changes made to those settings will not affect other threads.
ja: 各スレッドは上記の設定のコレクションを保持するため、これらの設定を変更しても他のスレッドには影響しない。

source: Each thread retains its own value of the last found window, meaning that if the current thread is interrupted by another, when the original thread is resumed it will still have its original value of the last found window, not that of the interrupting thread.
ja: 各スレッドは、最後に見つかったウィンドウの値を保持する。つまり、現在のスレッドが他のスレッドによって中断された場合、元のスレッドが再開されると、中断されたスレッドの値ではなく、最後に見つかったウィンドウの元の値が保持される。

source: Each Alt-Tab hotkey must be either a single key or a combination of two keys, which is typically achieved via the ampersand symbol (&).
ja: Alt-Tabの各ホットキーは、単一のキーまたは2つのキーの組み合わせでなければならず、通常はアンパサンドシンボル（&）で実現します。

source: Each GUI window may have up to 11,000 controls.
ja: 1つのGUIウィンドウには、最大11,000個のコントロールが可能です。

source: Each array element contains the full path of a file.
ja: 各配列要素には、ファイルのフルパスが含まれます。

source: Each attempt to change its position will instead slide the bar by one increment.
ja: 位置を変えようとするたびに、代わりにバーが1刻みスライドする。

source: Each call to the enumerator returns the next array element.
ja: 列挙者を呼び出すたびに、次の配列要素が返されます。

source: Each call to the enumerator returns the next control.
ja: 列挙者を呼び出すたびに、次のコントロールが返されます。

source: Each call to the enumerator returns the next key and/or value.
ja: 列挙者を呼び出すたびに、次のキーや値が返されます。

source: Each call to the enumerator returns the next property name and/or value.
ja: 列挙者を呼び出すたびに、次のプロパティ名や値が返されます。

source: Each call to the outer function creates new closures, distinct from any previous calls.
ja: 外側の関数を呼び出すたびに、以前の呼び出しとは異なる新しいクロージャが作成されます。

source: Each callback may inspect Value and either suppress or allow further callbacks and default handling.
ja: 各コールバックはValueを検査し、更なるコールバックとデフォルトの処理を抑制するか許可することができる。

source: Each case implicitly ends at the next Case/Default or the closing brace.
ja: 各ケースは、次のケース/ デフォルトまたは閉じ中括弧で暗黙のうちに終了する。

source: Each case may list up to 20 values.
ja: 各ケースは最大20の値をリストすることができる。

source: Each case value is considered separately and does not affect the type of comparison used for other case values.
ja: 各ケース値は個別に検討され、他のケース値で使用される比較のタイプには影響しない。

source: Each character in the string is represented by a number, called its ordinal number, or character code.
ja: 文字列の各文字は、その序数（文字コード）と呼ばれる数字で表現されます。

source: Each class can define one or both halves of a property.
ja: 各クラスはプロパティの片方または両方を定義できる。

source: Each class has a Prototype property containing an object which all instances of that class are based on, while the class itself becomes the base object of any direct subclasses.
ja: 各クラスには、そのクラスのすべてのインスタンスがベースとするオブジェクトを含むPrototypeプロパティがあり、クラス自体は直接のサブクラスのベース・オブジェクトとなる。

source: Each class is initialized automatically when a reference to the class is evaluated for the first time.
ja: 各クラスは、そのクラスへの参照が初めて評価されるときに自動的に初期化される。

source: Each class object has a Prototype property which becomes the base of all instances of that class.
ja: 各クラスオブジェクトには、そのクラスのすべてのインスタンスのbaseとなるPrototypeプロパティがあります。

source: Each class object is based on whatever class it extends, or Object if not specified.
ja: 各クラスオブジェクトは、そのクラスが拡張するクラス、または指定されていない場合はObjectを 基にしています。

source: Each class's Prototype is based on the Prototype of its base class, so x.HasBase(Object.Prototype) is also true.
ja: 各クラスのPrototypeはベース・クラスのPrototypeに基づいているので、x.HasBase(Object.Prototype)も真になる。

source: Each comment can appear to the right of a line or on a new line by itself.
ja: 各コメントは、行の右側に表示することも、それ自体で改行することもできる。

source: Each comparison is case-insensitive according to the rules of the current user's locale.
ja: 各比較は、現在のユーザーのロケールの規則に従って大文字と小文字を区別しない。

source: Each comparison is case-sensitive.
ja: 各比較は大文字と小文字を区別する。

source: Each compiled script .exe is based on an executable file which implements the interpreter.
ja: コンパイルされた各スクリプト.exeは、インタプリタを実装した実行ファイルをベースにしている。

source: Each component shown above has a Connector, and it is the Connector that defines the component's name.
ja: 上に示した各コンポーネントにはConnectorがあり、コンポーネントの名前を定義するのはConnectorである。

source: Each control (such as volume or mute) is represented by a Subunit which sits between the Connector and the endpoint.
ja: 各コントロール（ボリュームやミュートなど）は、コネクタとエンドポイントの間に位置するサブユニットによって表される。

source: Each control can have its own ContextMenu event callback which is called before any callback registered for the Gui object.
ja: 各コントロールは独自のContextMenuイベントコールバックを持つことができ、Guiオブジェクトに登録されたどのコールバックよりも先に呼び出されます。

source: Each declaration acts as a normal property assignment, with the class object as the target.
ja: 各宣言は、クラス・オブジェクトをターゲットとして、通常のプロパティ割り当てとして動作します。

source: Each event callback is called in a new thread, and therefore starts off fresh with the default values for settings such as SendMode.
ja: 各イベントコールバックは新しいスレッドで呼び出されるため、SendModeなどの設定のデフォルト値で新たにスタートします。

source: Each format specifier can include the following components, in this order (without the spaces):
ja: 各フォーマット指定子は、以下の構成要素をこの順序で含むことができる（空白は除く）：

source: Each function definition creates a constant (read-only variable) within the current scope.
ja: 各関数定義は、現在のスコープ内に定数（読み取り専用変数）を作成します。

source: Each function definition creates a read-only variable containing the function itself; that is, a Func or Closure object.
ja: 各関数定義は、関数そのものを含む読み取り専用の変数、つまりFuncまたはClosureオブジェクトを作成します。

source: Each has their own special features.
ja: それぞれに特徴あります。

source: Each hotstring abbreviation can be no more than 40 characters long.
ja: 各ホットストリングの略号の長さは40文字以内とします。

source: Each initializer has no effect the second time it is reached.
ja: 各イニシャライザーは、2回目に到達したときには何の効果もありません。

source: Each instance of Object consists of a set of "own properties" and a base object, from which more properties are inherited.
ja: Objectの各インスタンスは、「自身のプロパティ」のセットと、より多くのプロパティが継承されるベースオブジェクトから構成されています。

source: Each item fits into a rectangle of this size when arranged.
ja: 各アイテムを並べると、このサイズの長方形に収まる。

source: Each item is assumed to be a number rather than a string (for example, if this option is not present, the string 233 is considered to be less than the string 40 due to alphabetical ordering).
ja: 各項目は文字列ではなく数値であるとみなされます（たとえば、このオプションがない場合、アルファベット順のため、文字列233は文字列40より小さいとみなされます）。

source: Each item is terminated with a carriage return and newline (`r`n), but may span multiple lines if the variable contains `r`n.
ja: 各項目はキャリッジリターンとニューライン（`r`n）で終了するが、変数に`r`nが含まれている場合は複数行に渡ることもあります。

source: Each key or index should be accepted as a parameter of the __Item property.
ja: 各キーまたはインデックスは、__Itemプロパティのパラメータとして受け入れられるべきである。

source: Each line may be formatted as follows:
ja: 各行の書式は、次のようにすることができる：

source: Each line of text on A_Clipboard typically ends with carriage return and linefeed (CR+LF), which can be expressed in the script as `r`n.
ja: A_Clipboardの各行のテキストは通常、キャリッジリターンとラインフィード（CR+LF）で終わり、スクリプトでは`r`nと表現することができます。

source: Each macro may optionally be assigned to a hotkey.
ja: 各マクロはオプションでホットキーに割り当てることができる。

source: Each menu item is assigned an ID when it is first added to the menu.
ja: 各メニューには、最初にメニューに追加されるときにIDが割り当てられます。

source: Each message contains the following, usually written where the property or method is called:
ja: 各メッセージには以下の内容が含まれており、通常はプロパティやメソッドが呼び出される場所に書かれています：

source: Each method definition creates a Func with a hidden first parameter named this, and defines a property which is used to call the method or retrieve its function object.
ja: 各メソッド定義は、thisという名前の隠された第1パラメータを持つFuncを作成し、メソッドの呼び出しやその関数オブジェクトの取得に使用されるプロパティを定義する。

source: Each minimized window fits into a rectangle this size when arranged.
ja: 最小化されたウィンドウを並べると、このサイズの矩形に収まる。

source: Each modifier is always qualified with < (left) or > (right).
ja: 各モディファイアは必ず <（左）または > （右）で修飾されます。

source: Each name consists of the control's class name followed immediately by its sequence number (ClassNN), as shown by Window Spy.
ja: 名前は、コントロールのクラス名とその直後にWindow Spy で示されるシーケンス番号 (ClassNN) が続く形構成されています。

source: Each name of a control consists of its class name followed immediately by its sequence number (ClassNN), as shown by Window Spy.
ja: コントロールの各名称は、Window Spyで示されているように、そのクラス名の直後にシーケンス番号（ClassNN）が付いたものです。

source: Each name-value pair causes a value property to be defined, with the exception that Base can be set (with the same restrictions as a normal assignment).
ja: 各名前と値のペアは、値のプロパティを定義させるが、例外としてBaseを設定することができる（通常の代入と同じ制限がある）。

source: Each number corresponds to a specific error condition (to get a list, search www.microsoft.com for "system error codes").
ja: 各番号は特定のエラー状態に対応している（リストを入手するには、www.microsoft.com「システムエラーコード」で検索）。

source: Each number corresponds to a specific error condition.
ja: 各々の数値は、特定のエラー条件に対応しています。

source: Each number is a window handle (HWND).
ja: それぞれの数字はウィンドウ・ハンドル（HWND）である。

source: Each number is written at the next byte after the previous number, with no padding.
ja: 各数値は、前の数値の次のバイトに、パディングなしで書き込まれます。

source: Each numpad key can be made to launch two different hotkey subroutines depending on the state of NumLock.
ja: それぞれのテンキーは、NumLockの状態に応じて2つの異なるホットキーサブルーチンを起動させることができます。

source: Each object has a unique address which is also an interface pointer compatible with IDispatch.
ja: 各オブジェクトは、IDispatchと互換性のあるインターフェースポインタでもあるユニークなアドレスを持っています。

source: Each object has a unique address (location in memory), which can be retrieved by the ObjPtr function, but is typically not used directly.
ja: 各オブジェクトは固有のアドレス（メモリ上の位置）を持っており、ObjPtr関数で取得することができますが、通常、直接使用することはありません。

source: Each object is dynamically allocated and reference-counted.
ja: 各オブジェクトは動的に割り当てられ、参照カウントされる。

source: Each of these pairs represents a single parameter to be passed to the function.
ja: これらのペアはそれぞれ、関数に渡される1つのパラメータを表しています。

source: Each of these pairs represents a single parameter to be passed to the method.
ja: これらのペアはそれぞれ、メソッドに渡される1つのパラメータを表しています。

source: Each option is either a single letter immediately followed by a value, or a single word.
ja: 各オプションは、1文字に続けて値を指定するか、1つの単語を指定します。

source: Each pair consists of a literal (unquoted) property name and a value (sub-expression) separated by a colon (:).
ja: 各ペアは、コロン（:）で区切られたリテラル（引用符で囲まれていない）プロパティ名と値（サブ式）で構成されます。

source: Each pair consists of a literal property name a and a property value expression b.
ja: 各ペアは、リテラル・プロパティ名aとプロパティ値式bで構成される。

source: Each parameter becomes an alias for the variable represented by the VarRef.
ja: 各パラメーターは、VarRefで表される変数のエイリアスになります。

source: Each parameter is a value, such as a string or number.
ja: 各パラメーターは、文字列や数値などの値です。

source: Each parameter must be a single quoted string, and no more than two parameters may be used.
ja: 各パラメータは1つの引用符で囲まれた文字列でなければならず、2つ以上のパラメータを使用することはできない。

source: Each parameter must be an integer or an object with a Ptr property, such as a Buffer.
ja: 各パラメータは、整数またはBufferなどのPtrプロパティを持つオブジェクトでなければなりません。

source: Each parameter must be an integer.
ja: 各パラメータは整数値でなければなりません。

source: Each parameter should be a reference to the variable in which to store the respective coordinate.
ja: 各パラメータは、それぞれの座標を格納する変数への参照とします。

source: Each process has an ID number which remains unique until the process exits.
ja: 各プロセスにはID番号があり、プロセスが終了するまで一意であります。

source: Each property is present only if the corresponding accessor function is defined in Obj itself.
ja: 各プロパティは、対応するアクセサー関数がObj自身に定義されている場合にのみ存在します。

source: Each property or method owned by the object is copied into the clone.
ja: オブジェクトが所有する各プロパティやメソッドは、クローンにコピーされます。

source: Each rectangle consists of 5 pairs of X/Y coordinates because the first pair is repeated at the end to "close off" each rectangle.
ja: 各矩形は5組のX/Y座標で構成されるが、これは最初の組が各矩形を「閉じる」ために最後に繰り返されるからである。

source: Each reference to A_IPAddress%N% retrieved all addresses but returned only one, so retrieving multiple addresses took exponentially longer than necessary.
ja: A_IPAddress%N%を参照するたびに、すべてのアドレスを検索しますが、1つしか返さないため、複数のアドレスを検索すると、必要以上に指数関数的に時間がかかります。

source: Each reference to a variable or function is resolved to a memory address, unless it is dynamic.
ja: 変数や 関数への各参照は、それが動的でない限りメモリアドレスに解決されます。

source: Each script is a plain text file containing lines to be executed by the program (AutoHotkey.exe).
ja: 各スクリプトは、プログラム（AutoHotkey.exe）によって実行される行を含むプレーンテキストファイルです。

source: Each script is semi-compiled while it is being loaded and syntax-checked.
ja: 各スクリプトはロード中にセミコンパイルされ、シンタックスチェックされます。

source: Each standard item has an internal menu item ID corresponding to the function it performs, but can otherwise be modified or deleted like any other menu item.
ja: 各標準項目は、その機能に対応する内部メニュー項目IDを持つが、それ以外は他のメニュー項目と同様に変更または削除することができます。

source: Each statement name is replaced by an address in a jump table.
ja: 各ステートメント名は、ジャンプテーブルのアドレスに置き換えられます。

source: Each string is actually a sequence or string of characters, but can be treated as a single entity.
ja: 各文字列は、実際には文字の配列または文字列ですが、1つの実体として扱うことができます。

source: Each template may contain an INI section as follows:
ja: 各テンプレートは、以下のようなINIセクションを含むことができる：

source: Each text element ends with a carriage return and linefeed (CR+LF), which can be represented in the script as `r`n.
ja: 各テキスト要素はスクリプトで`r`nと表現されるキャリッジリターンとラインフィード(CR+LF)で終わります。

source: Each use of CallbackCreate allocates a small amount of memory (32 or 48 bytes plus system overhead).
ja: CallbackCreateを使用するたびに、少量のメモリ（32または48バイトとシステム・オーバーヘッド）が割り当てられる。

source: Each use of this function adds a new rule to a group.
ja: この機能を使用するたびに、グループに新しいルールが追加されます。

source: Each user-defined or built-in class is a class object (an instance of Class) exposing only methods and properties defined with the static keyword (including static members inherited from the base class) and nested classes.
ja: ユーザー定義クラスや組み込みクラスは、staticキーワードで定義されたメソッドやプロパティ（ベースクラスから継承したstaticメンバを含む）とネストしたクラスのみを公開するクラスオブジェクト（Classのインスタンス）です。

source: Each value is a separate parameter.
ja: 各値は独立したパラメータです。

source: Each value must be an expression, but can be a simple one such as a literal number, quoted string or variable.
ja: 各値は式でなければならないが、リテラル数値、引用符で囲まれた文字列、変数などの単純なものでもよい。

source: Each variable is not permanently restricted to a single data type, but can instead hold a value of any type:
ja: 各変数は永久に単一のデータ型に制限されることはなく、代わりに任意の型の値を保持することができます。

source: Each variable is not permanently restricted to a single data type, but can instead hold a value of any type: string, number or object.
ja: 各変数は永久に単一のデータ型に制限されることはなく、代わりに任意の型の値を保持することができます：文字列、数値、またはオブジェクト。

source: Each version installs into its own subdirectory.
ja: 各バージョンはそれぞれのサブディレクトリにインストールされる。

source: Each version is given a distinguishing version number.
ja: 各バージョンには、識別できるバージョン番号が与えられている。

source: Each window has an ID number which remains unique until the window is destroyed.
ja: 各ウィンドウにはID番号があり、ウィンドウが破壊されるまで一意であることが確認されています。

source: Each window is evaluated against the window group as a whole, without distinguishing between window specifications.
ja: 各ウィンドウは、ウィンドウの仕様を区別することなく、ウィンドウグループ全体に対して評価されます。

source: Each window or control has a unique ID, also known as a HWND (short for handle to window).
ja: 各ウィンドウやコントロールには固有のIDがあり、HWND（ウィンドウへのハンドルの略）としても知られている。

source: Easy Access to Favorite Folders
ja: お気に入りフォルダへの簡単アクセス

source: Easy Window Dragging
ja: 簡単なウィンドウのドラッグ

source: Easy Window Dragging (KDE style)
ja: 簡単なウィンドウドラッグ（KDEスタイル）

source: Easy.
ja: 簡単だ。

source: Edit - Syntax & Usage | AutoHotkey v2
ja: Edit - 構文と使用法｜AutoHotkey v2

source: Edit Control Styles
ja: Editコントロールのスタイル

source: Edit Script - See Edit.
ja: スクリプトの編集 -編集を参照。

source: Edit a Script
ja: スクリプトの編集

source: Edit script
ja: スクリプトを編集する

source: Edit template:
ja: テンプレートを編集する：

source: Edit template: Open the template in the default editor.
ja: Edit template：デフォルトのエディタでテンプレートを開く。
